{"name":"Jun's Ramen","description":"Ramen can be done in many ways, and it's one of the most difficult recipes to master. But don't fret! If you follow [Jun](https://www.youtube.com/c/JunsKitchen)'s advice, this will be an excellent way to get started.", "imageUrl": "https://i.ytimg.com/vi/9WXIrnWsaCo/hqdefault.jpg","servings":"3 persons","prepTime":"1 day", "cookTime":"30 minutes","ingredients":["500g Boston Butt Pork","200ml Soy Sauce","150ml Sake","100ml Mirin","50ml Bonito Stock Soup (optional)","3-5 Chicken Wings","3-5 slices of Ginger","30g Japanese Anchovy","15g Bonito Flakes","15g Kelp","2 Dried Shiitake Mushrooms","2 Eggs","1 Chicken Bone","1 clove of Garlic","1 Green Onion","Any types of clams you want"],"instructions":["Start with the pork. Rub in salt to season. Then, slowly sear the outside.", "Next, make the sauce for the pork and boiled eggs. Get the green part of the green onion, a few slices of ginger and crush the garlic. Add sake, mirin, soy sauce, sugar and salt in a pot and heat it up on low heat. Turn off the burner before it boils.","Now wrap the pork with a paper towel and put everything in a zip up bag. Then get rid of the air inside the bag, using a bowl of water makes this process easy. Then place it inside the rice cooker and add boiled water. Press the \"keep warm\" button, and it'll be done cooking in about 3-4 hours. Then keep it in a fridge for half a day.","Now make hard boiled eggs. Making a tiny hole at the bottom of the eggs prevents them from cracking. Boil the eggs for 6 minutes and a half. Take the eggs out and cool them down. When they're cooled down, get rid of the shells. Place eggs in tupperware, and add equal parts of water and sauce. Then, cover them with a paper towel and keep them in the fridge for half a day as well.","Now make the soup. Prepare the soup stock with the following combinations: kombu in soy sauce, kombu in water, mushrooms in water and anchovy katsuobushi in hot water. Next, add green onion, ginger slices, chicken bones and wings in boiled water, and boil them for a minute to get rid of the smell. Place them in cold water and chop the bones into chunks. Put the bones and chicken wings in a pot and cook it on very low heat for an hour.","At the same time, make clam soup. Before cooking the clams, get rid of the sand by adding 3% salt water and wait for half a day. Boil the clams with sake and kombu for 30 minutes on low heat. Skim off scum while boiling.","Cut off the skin of chicken and fry it on low heat until it becomes crispy. Save the chicken oil for the soup and the chicken skin for a topping later.","Make another topping. Cut off the white part of the green onion, cut off the core, and slice it thinly. Soak it in water for 5 minutes.","Now blend all the soup. The blend ratio is completely up to you. For example, if you want the soup to be a little more fishy, then add more bonito stock. One example ratio is 4 fish soup : 3 chicken soup : 1 clam soup : 1 kombu soup : 1 mushroom soup. When the soup is done, add soy sauce with kombu and chicken oil in the ramen bowl first.","Prepare the toppings. Scorch the pork slices. Cut an egg in half. Pour soup in the bowl.","Finally, boil the noodles, strain them well and finish assembling the ramen bowl.","Itadakimasu!"],"externalUrls":["https://www.youtube.com/watch?v=9WXIrnWsaCo"]}
